# Partie A

1. Charger le fichier `customers.csv` et afficher les 5 premières lignes.

In [1]:
import pandas as pd

In [12]:
data = pd.read_csv('./data/customers.csv')
data.head(5)

   id     name  age       city
0   1    Alice   25      Paris
1   2      Bob   35       Lyon
2   3  Charlie   40  Marseille
3   4    Diana   28      Paris
4   5    Ethan   32      Lille

2. Afficher uniquement la colonne `name`.

In [3]:
data['name']

0       Alice
1         Bob
2     Charlie
3       Diana
4       Ethan
5       Fiona
6      George
7      Hannah
8         Ian
9        Jane
10      Kevin
11      Linda
12       Mike
13       Nina
14      Oscar
Name: name, dtype: object

3. Lister les clients de Paris.

In [4]:
city = data.loc[data['city'] == "Paris", 'name' ]
city

0    Alice
3    Diana
8      Ian
Name: name, dtype: object

4. Trier les clients par âge décroissant.

In [5]:
data.sort_values(by = ['age'], ascending = False)

    id     name  age        city
6    7   George   45    Bordeaux
2    3  Charlie   40   Marseille
8    9      Ian   38       Paris
12  13     Mike   36    Bordeaux
1    2      Bob   35        Lyon
14  15    Oscar   34  Strasbourg
10  11    Kevin   33        Nice
4    5    Ethan   32       Lille
7    8   Hannah   31  Strasbourg
13  14     Nina   30       Lille
5    6    Fiona   29        Nice
3    4    Diana   28       Paris
9   10     Jane   27        Lyon
11  12    Linda   26   Marseille
0    1    Alice   25       Paris

5. Compter combien de clients viennent de chaque ville.

In [6]:
count_city = data['city'].value_counts()
count_city

city
Paris         3
Lyon          2
Marseille     2
Lille         2
Nice          2
Bordeaux      2
Strasbourg    2
Name: count, dtype: int64

6. Sauvegarder les clients de Lyon dans `data/lyon_clients.csv`.  
*(Optionnel)* Lister les clients dont le nom commence par “A”.

In [7]:
lyon = data[data["city"] == "Lyon"]
lyon.to_csv('./data/lyon_clients.csv', index = False)

In [8]:
data["city"] == "Lyon"

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13    False
14    False
Name: city, dtype: bool

In [9]:
client_a = data[data.name.str.startswith("A")]
client_a

   id   name  age   city
0   1  Alice   25  Paris

# Partie B

7. Charger la table `orders` depuis la base `marketing.db`.

In [ ]:
import sqlite3
# Connection à la db
conn = sqlite3.connect("./data/marketing.db")
# Charger la table
order = pd.read_sql("SELECT * FROM orders", conn)

order

    id  customer_id  amount  order_date
0    1            1    39.9  2025-06-01
1    2            2   120.0  2025-06-02
2    3            1    59.0  2025-06-03
3    4            3    80.0  2025-06-04
4    5            4    25.0  2025-06-05
5    6            5    75.5  2025-06-06
6    7            2   200.0  2025-06-07
7    8           10    50.0  2025-06-08
8    9           10    90.0  2025-06-09
9   10           11   110.0  2025-06-10
10  11            2    60.0  2025-06-11

8. Lister les 5 premières commandes avec le nom du client (colonne `name`).

In [82]:
customers = pd.read_sql("SELECT * FROM customers", conn)
# effectuer la jointure : on suppose que la colonne d’identifiant s’appelle customer_id dans les deux tables
data_join = order.merge(customers, on="id", how="left")
# Selection les colonnes 
data_with_client = data_join[["customer_id", "amount"]].reset_index()
# Affiche les 5 premieres commande
data_with_client.head()

   index  customer_id  amount
0      0            1    39.9
1      1            2   120.0
2      2            1    59.0
3      3            3    80.0
4      4            4    25.0

In [83]:
query = '''
SELECT c.name, c.city, order_date, amount
FROM orders
JOIN customers c ON customer_id=c.id
'''
orders5 = pd.read_sql(query, conn)

orders5

       name       city  order_date  amount
0     Alice      Paris  2025-06-01    39.9
1       Bob       Lyon  2025-06-02   120.0
2     Alice      Paris  2025-06-03    59.0
3   Charlie  Marseille  2025-06-04    80.0
4     Diana      Paris  2025-06-05    25.0
5     Ethan      Lille  2025-06-06    75.5
6       Bob       Lyon  2025-06-07   200.0
7      Jane       Lyon  2025-06-08    50.0
8      Jane       Lyon  2025-06-09    90.0
9     Kevin       Nice  2025-06-10   110.0
10      Bob       Lyon  2025-06-11    60.0

9. Calculer le total dépensé par chaque client.

In [81]:
total_depense = orders5.groupby("name")["amount"].sum()

total_depense

name
Alice       98.9
Bob        380.0
Charlie     80.0
Diana       25.0
Ethan       75.5
Jane       140.0
Kevin      110.0
Name: amount, dtype: float64